{
  "_name_or_path": "Dataset/SROIE2019/layoutlm-base-uncased",
  "architectures": [
    "LayoutLMForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-HEADER",
    "2": "I-HEADER",
    "3": "B-QUESTION",
    "4": "I-QUESTION",
    "5": "B-ANSWER",
    "6": "I-ANSWER",
    "7": "B-COMPANY",
    "8": "I-COMPANY",
    "9": "B-DATE",
    "10": "I-DATE",
    "11": "B-ADDRESS",
    "12": "I-ADDRESS",
    "13": "B-TOTAL",
    "14": "I-TOTAL"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ADDRESS": 11,
    "B-ANSWER": 5,
    "B-COMPANY": 7,
    "B-DATE": 9,
    "B-HEADER": 1,
    "B-QUESTION": 3,
    "B-TOTAL": 13,
    "I-ADDRESS": 12,
    "I-ANSWER": 6,
    "I-COMPANY": 8,
    "I-DATE": 10,
    "I-HEADER": 2,
    "I-QUESTION": 4,
    "I-TOTAL": 14,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 512,
  "model_type": "layoutlm",
  "num_attention_heads": 16,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
